index.html
<!DOCTYPE html>
<html prefix="og: http://ogp.me/ns# article: http://ogp.me/ns/article# " lang="en">
<head>
<meta charset="utf-8">
<meta name="description" content="Where flush ideas.?">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>mindtoilet</title>
<link href="assets/css/all-nocdn.css" rel="stylesheet" type="text/css">
<meta name="theme-color" content="#5670d4">
<meta name="generator" content="Nikola (getnikola.com)">
<link rel="alternate" type="application/rss+xml" title="RSS" href="rss.xml">
<link rel="canonical" href="https://mindtoilet.github.io/">
<!--[if lt IE 9]><![endif]--><link rel="prefetch" href="posts/how-to-write-a-blog-using-nikola/" type="text/html">
</head>
<body>
<a href="#content" class="sr-only sr-only-focusable">Skip to main content</a>

<!-- Menubar -->

<nav class="navbar navbar-inverse navbar-static-top"><div class="container">
<!-- This keeps the margins nice -->
        <div class="navbar-header">
            <button type="button" class="navbar-toggle collapsed" data-toggle="collapse" data-target="#bs-navbar" aria-controls="bs-navbar" aria-expanded="false">
            <span class="sr-only">Toggle navigation</span>
            <span class="icon-bar"></span>
            <span class="icon-bar"></span>
            <span class="icon-bar"></span>
            </button>
            <a class="navbar-brand" href="https://mindtoilet.github.io/">

                <span id="blog-title">mindtoilet</span>
            </a>
        </div>
<!-- /.navbar-header -->
        <div class="collapse navbar-collapse" id="bs-navbar" aria-expanded="false">
            <ul class="nav navbar-nav">
<li>
<a href="archive.html">Archive</a>
                </li>
<li>
<a href="categories/">Tags</a>
                </li>
<li>
<a href="rss.xml">RSS feed</a>

                
            </li>
</ul>
<ul class="nav navbar-nav navbar-right"></ul>
</div>
<!-- /.navbar-collapse -->
    </div>
<!-- /.container -->
</nav><!-- End of Menubar --><div class="container" id="content" role="main">
    <div class="body-content">
        <!--Body content-->
        <div class="row">
            
            

    


    
<div class="postindex">
    <article class="h-entry post-text"><header><h1 class="p-name entry-title"><a href="posts/how-to-write-a-blog-using-nikola/" class="u-url">Blogging using nikola-github-emacs-orgmode</a></h1>
        <div class="metadata">
            <p class="byline author vcard"><span class="byline-name fn" itemprop="author">
                Human
            </span></p>
            <p class="dateline"><a href="posts/how-to-write-a-blog-using-nikola/" rel="bookmark"><time class="published dt-published" datetime="2018-02-09T01:38:14+05:30" title="2018-02-09 01:38">2018-02-09 01:38</time></a></p>
                <p class="commentline">
        
    <a href="posts/how-to-write-a-blog-using-nikola/#disqus_thread" data-disqus-identifier="cache/posts/how-to-write-a-blog-using-nikola.html">Comments</a>


        </p>
</div>
    </header><div class="e-content entry-content">
    <div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">Blog about writing blogs</h2>
<div class="outline-text-2" id="text-1">
<p>
This blog about writing blogs is written upon request by pestering
friends. Special thanks to all other blogs about writing blogs which
helped me write this blog about writing blogs.
</p>
</div>
</div>
<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2">You will be reading about… Will you?</h2>
<div class="outline-text-2" id="text-2">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<colgroup>
<col class="left">
<col class="left">
</colgroup>
<thead><tr>
<th scope="col" class="left"><a href="https://getnikola.com/">Nikola</a></th>
<th scope="col" class="left">Static website generator</th>
</tr></thead>
<tbody><tr>
<td class="left"><a href="https://guides.github.com/activities/hello-world/">Github</a></td>
<td class="left">Free website hosting</td>
</tr></tbody>
<tbody><tr>
<td class="left"><a href="https://www.gnu.org/software/emacs/tour/">emacs</a></td>
<td class="left">Emacs : A wonderful text editor</td>
</tr></tbody>
<tbody><tr>
<td class="left"><a href="https://en.wikipedia.org/wiki/Org-mode">orgmode</a></td>
<td class="left">Headings, Tables, Text formatting, Genetically Awesome!!!</td>
</tr></tbody>
<tbody><tr>
<td class="left"><a href="http://docs.python-guide.org/en/latest/dev/virtualenvs/">Python virtual environment</a></td>
<td class="left">A special work place without pollution</td>
</tr></tbody>
</table>
<p>
\\
Curious Columbus-es should then follow the links.
(or) If you just want to get your blog up and running then,
bother not, you shall.
</p>
</div>
</div>
<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3">Well…</h2>
<div class="outline-text-2" id="text-3">
<p>
The idea is to create a blogging website hosted in <i>Github</i>, using a
static site generator software <i>Nikola</i>, with the help of <i>Python
virtual environment</i> and then write blog posts using <i>emacs org mode</i>.
</p>
</div>
<div id="outline-container-sec-3-0-1" class="outline-4">
<h4 id="sec-3-0-1">Also</h4>
<div class="outline-text-4" id="text-3-0-1">
<ol class="org-ol">
<li>I'm using Linux.
</li>
<li>I will be assuming the name of your blog as 'bottle'
</li>
</ol>
</div>
</div>
</div>
<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4">GitHub</h2>
<div class="outline-text-2" id="text-4">
<p>
Create a GitHub account. Create a repository with the following name:
'bottle.github.io'. <a href="https://guides.github.com/activities/hello-world/">Instructions</a>.
</p>

<p>
Once you do this, then GitHub will host your website in the following
address(URL) : <a href="https://bottle.github.io/">https://bottle.github.io/</a>
</p>

<p>
Clone(copy) this newborn repository into your local machine a.k.a
personal computer by using the following command:
</p>
<div class="highlight"><pre><span></span>$ git clone https://bottle.github.io/ ~/projects/bottle
</pre></div>

<p>
You will be adding blog posts in ~/projects/bottle directory and will
push them back to GitHub later.
</p>
</div>
</div>
<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5">Python Virtual Environment</h2>
</div>
<div id="outline-container-sec-6" class="outline-2">
<h2 id="sec-6">Nikola</h2>
<div class="outline-text-2" id="text-6">
</div>
<div id="outline-container-sec-6-1" class="outline-3">
<h3 id="sec-6-1">Installation</h3>
</div>
<div id="outline-container-sec-6-2" class="outline-3">
<h3 id="sec-6-2">Website</h3>
</div>
<div id="outline-container-sec-6-3" class="outline-3">
<h3 id="sec-6-3">Posts</h3>
</div>
<div id="outline-container-sec-6-4" class="outline-3">
<h3 id="sec-6-4">Publish</h3>
</div>
<div id="outline-container-sec-6-5" class="outline-3">
<h3 id="sec-6-5">Themes</h3>
</div>
</div>
<div id="outline-container-sec-7" class="outline-2">
<h2 id="sec-7">Thanks</h2>
</div>
    </div>
    </article>
</div>



        
       <script>var disqus_shortname="mindtoilet";(function(){var a=document.createElement("script");a.async=true;a.src="https://"+disqus_shortname+".disqus.com/count.js";(document.getElementsByTagName("head")[0]||document.getElementsByTagName("body")[0]).appendChild(a)}());</script>
</div>
        <!--End of body content-->

        <footer id="footer">
            Contents © 2018         <a href="mailto:mindtoilet@gmail.com">Human</a> - Powered by         <a href="https://getnikola.com" rel="nofollow">Nikola</a>         
            
        </footer>
</div>
</div>


            <script src="assets/js/all-nocdn.js"></script><script>$('a.image-reference:not(.islink) img:not(.islink)').parent().colorbox({rel:"gal",maxWidth:"100%",maxHeight:"100%",scalePhotos:true});</script><!-- fancy dates --><script>
    moment.locale("en");
    fancydates(0, "YYYY-MM-DD HH:mm");
    </script><!-- end fancy dates -->
</body>
</html>
